{
  "id": "t105",
  "table_no": 105,
  "name": "Número de Transações Suspeitas",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Integridade"
  },
  "fields": {
    "definition": "Definition: Mede o número total de transações identificadas\ncomo suspeitas em uma rede blockchain, com base\nem um modelo de análise de risco que utiliza métricas\nde confiabilidade, credibilidade e grau de suspiciousness.\nEssa métrica indica a frequência e a intensidade de comportamentos potencialmente anômalos ou fraudulentos\nem contas e transações.",
    "equation": "O número de transações suspeitas (Ns) é calculado como:\nNs =\nT\nX\ni=1\nI(Si ≥θ)\nonde Si é o grau de suspiciousness da transação i e θ é\no limiar definido pelo modelo de classificação. Apenas\ntransações com Si ≥θ são consideradas suspeitas.\nMétricas\nAssociadas\nGrau de Confiabilidade da Conta; Grau de Credibilidade;\nGrau de Suspiciousness; Número de Contas de Risco;\nNúmero Total de Transações\nAtributo\nRelacionado\nDetecção de Anomalias; Classificação de Contas; Segurança Transacional; Análise de Comportamento",
    "unit": "Número de transações suspeitas (transações)",
    "protocol": "1) Coletar dados de transações Ethereum a partir de\nexploradores públicos (ex.: Etherscan).\n2) Construir um grafo direcionado com nós representando\ncontas e arestas representando transações.\n3) Calcular para cada conta os escores de credibility,\nreliability e suspiciousness segundo o modelo proposto.\n4) Classificar transações como suspeitas quando o valor\nde suspiciousness ultrapassar o limiar definido (θ).\n5) Contabilizar o total de transações suspeitas em relação\nao conjunto de transações analisadas.\n252",
    "comment": "O artigo propõe um framework de classificação de\nrisco de contas Ethereum baseado em aprendizado\nde máquina e análise de grafos. Cada transação recebe\num grau de suspiciousness, calculado com base em características comportamentais da conta, como padrão\nde envio/recebimento e relações com outras contas. O\nnúmero de transações suspeitas é um indicador-chave da\nsaúde e segurança da rede, permitindo detectar contas\ncom alto risco e prevenir ataques ou fraudes.\nInterpretação\ndo\nValor Medido\nValores altos indicam presença significativa de atividades anômalas ou suspeitas na rede. Valores baixos\nindicam estabilidade e comportamento predominantemente legítimo entre as contas.",
    "scale_type": "Razão",
    "precision": "Depende da acurácia do modelo de classificação e da\ncompletude dos dados de transação. Quanto mais robusto o conjunto de características, maior a precisão na\ndetecção.",
    "data_collection": "Automática / Experimental",
    "use_processes": "Monitoramento de integridade de rede; detecção de fraudes e comportamentos anômalos; auditoria de carteiras;\nprevenção de lavagem de dinheiro; avaliação de risco em\nexchanges e dApps.",
    "objective": "Identificar e quantificar o volume de transações de risco\nem sistemas blockchain, permitindo a classificação de\ncontas potencialmente maliciosas e a detecção de comportamentos irregulares, como lavagem de dinheiro, ma-\nnipulação de tokens e wash trading.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "measurement_tool": "Framework de Classificação de Risco em Ethereum (Risk\nRating Framework); scripts de análise em Python; bases de dados de transações Ethereum; aprendizado de\nmáquina supervisionado.",
    "beneficiaries": "Analistas de segurança; auditores de blockchain; desenvolvedores de exchanges; pesquisadores em análise de\ncomportamento; entidades reguladoras.",
    "references": "Zhao, J.; Yuan, Y.; Zhou, T.; Wu, J.; Chen, Y. A General Framework for Account Risk Rating on Ethereum: Toward Safer\nBlockchain Technology. IEEE Transactions on Computational Social Systems, vol. 8, no. 6, pp. 1304–1315, 2021. — A métrica\nNumber of Suspicious Transactions mede o total de transações com alto grau de suspiciousness, usadas para detectar contas\nde risco e monitorar atividades anômalas na rede Ethereum.\n253"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 105"
  }
}