{
  "id": "t129",
  "table_no": 129,
  "name": "Razão de Impacto de Ataques DoS",
  "iso25010": {
    "characteristic": "Confiabilidade",
    "subcharacteristic": "Disponibilidade"
  },
  "fields": {
    "definition": "Definition: Mede o impacto causado por ataques de negação de serviço (DoS) sobre o desempenho e a disponibilidade de um sistema blockchain, quantificando a degradação observada em métricas como throughput, latência de confirmação e taxa de transações válidas durante o ataque.",
    "equation": "DIR = M_attack / M_normal,\nonde M_attack representa o valor da métrica de desempenho sob ataque (ex.: latência ou throughput) e M_normal representa o valor da mesma métrica em operação normal.",
    "unit": "Razão adimensional ou percentual (%)",
    "protocol": "1) Definir a métrica base a ser analisada (ex.: throughput, latência ou taxa de confirmação).\n2) Medir o desempenho do sistema em condições normais.\n3) Executar ou simular um ataque DoS (ex.: flooding de transações).\n4) Medir o desempenho do sistema durante o ataque.\n5) Calcular a razão de impacto DoS (DIR).\n6) Comparar resultados entre mecanismos de defesa ou arquiteturas distintas.",
    "comment": "Em sistemas baseados em IOTA e Tangle, o impacto de ataques DoS pode ser mitigado por mecanismos de validação distribuída e confirmação paralela de transações. Uma baixa razão de impacto indica maior resiliência do sistema e melhor manutenção da disponibilidade durante ataques.",
    "scale_type": "Razão",
    "precision": "Dependente da precisão das medições de desempenho e da intensidade do ataque simulado.",
    "data_collection": "Experimental / Automática (monitoramento de desempenho durante ataques controlados)",
    "use_processes": "Avaliação de segurança e disponibilidade; comparação de mecanismos anti-DoS; validação de arquiteturas blockchain resilientes.",
    "objective": "Avaliar a resiliência e robustez de sistemas blockchain frente a ataques DoS. A métrica indica o quanto o sistema é afetado em termos de disponibilidade e qualidade de serviço quando submetido a tráfego malicioso ou sobrecarga intencional.",
    "measurement_tool": "Ferramentas de monitoramento de rede; simuladores de ataque DoS; logs de transações; scripts de análise de throughput e latência.",
    "beneficiaries": "Engenheiros de segurança; desenvolvedores de blockchain; pesquisadores em sistemas distribuídos; operadores de infraestruturas críticas.",
    "references": "Li, W.; Chen, X.; Zhang, J.; et al. An Efficient Distributed and Secure Algorithm for Transaction Confirmation in IOTA Using Cloud Computing. IEEE Access, 2020. — O estudo analisa o impacto de ataques DoS sobre a confirmação de transações e avalia mecanismos para manter a disponibilidade do sistema."
  },
  "source": {
    "pdf": "An_efficient_distributed_and_secure_algorithm_for_transaction_confirmation_in_IOTA_using_cloud_computing.pdf",
    "table": "Tabela 129"
  }
}