{
  "id": "t145",
  "table_no": 145,
  "name": "Capacidade de Transações",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Capacidade"
  },
  "fields": {
    "definition": "Definition: Quantidade total de valor (em BTC ou moeda equivalente) disponível em todos os canais de pagamento ativos\nda Lightning Network, representando a capacidade agregada de transações off-chain que podem ser realizadas\nsem depender diretamente do blockchain principal. A\nmétrica indica o limite teórico de volume que a rede pode\nsuportar em termos de liquidez e escalabilidade.",
    "equation": "Ctotal =\nn\nX\ni=1\nCapcanali\nonde Capcanali representa a capacidade de cada canal\nativo i, e n é o número total de canais na rede Lightning.\nO resultado pode ser expresso em BTC ou convertido em\nmoeda fiduciária (USD, EUR, BRL) conforme a cotação\nvigente.\nMétricas\nAssociadas\nTransaction Throughput; Network Liquidity; Channel\nAvailability; Node Connectivity\nAtributo\nRelacionado\nEficiência de Liquidez; Escalabilidade da Rede; Capacidade de Pagamento\n334",
    "unit": "BTC; USD; ou outra moeda equivalente",
    "protocol": "1) Mapear os nós e canais ativos da Lightning Network\nutilizando exploradores ou clientes LN (ex.: LND, clightning).\n2) Coletar a capacidade declarada de cada canal ativo\n(channel.capacity).\n3) Calcular a soma das capacidades de todos os canais\nabertos na rede no momento da análise.\n4) Converter o valor total para unidades monetárias\nequivalentes, se desejado.\n5) Analisar a evolução temporal da capacidade total\ne correlacionar com eventos de adoção (ex.: Taproot,\natualizações de protocolo).",
    "comment": "A Capacidade de Transações é um indicador-chave de\nliquidez e saúde econômica da Lightning Network. O\naumento da capacidade total reflete a maior confiança\ndos usuários e operadores de nós, indicando avanço na\nescalabilidade da rede Bitcoin. Entretanto, concentração\nde liquidez em poucos nós pode comprometer a descentralização, afetando a resiliência e a equidade das\ntransações.\nInterpretação\ndo\nValor Medido\nValores mais altos indicam maior liquidez e escalabilidade da rede, possibilitando maior volume de transações\nsimultâneas e valores mais altos de transferência. Valores baixos podem apontar concentração de canais, baixa\nadoção ou limitação na abertura de novos canais de\npagamento.",
    "scale_type": "Razão",
    "precision": "Depende da atualização dos dados de topologia e disponibilidade dos canais públicos. Canais privados podem não\nser contabilizados, levando à subestimação da capacidade\ntotal real.",
    "data_collection": "Automática (via APIs públicas e monitoramento da rede\nLightning)",
    "use_processes": "Análise de escalabilidade e crescimento da Lightning\nNetwork; monitoramento de liquidez e descentralização;\ncomparação de evolução temporal de capacidade; planejamento de políticas de roteamento de pagamentos.",
    "objective": "Avaliar o potencial de escalabilidade e a eficiência de\nliquidez da Lightning Network. A capacidade total de\ntransações é um indicador fundamental da maturidade\ne adoção do sistema, refletindo a confiança dos participantes na rede e sua utilidade para micropagamentos e\ntransações instantâneas.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "measurement_tool": "Exploradores da Lightning Network (ex.: amboss.space,\n1ml.com); clientes LN (LND, c-lightning); scripts de\nmonitoramento de topologia; consultas RPC.",
    "beneficiaries": "Pesquisadores de blockchain; desenvolvedores de segunda\ncamada; operadores de nós LN; analistas de desempenho\ne infraestrutura distribuída.\n335",
    "references": "Casas, P., Romiti, M., Holzer, P., Ben Mariem, S., Donnet, B.,\nHaslhofer, B. (2021). Where is the Light(ning) in the Taproot\nDawn? Unveiling the Bitcoin Lightning (IP) Network. IEEE 10th\nInternational Conference on Cloud Networking (CloudNet). —\nDefine e analisa a capacidade de transações como um indicador\nde liquidez e adoção da Lightning Network, correlacionando a\ntopologia da rede com sua eficiência operacional e escalabilidade.\n336"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 145"
  }
}