{
  "id": "t43",
  "table_no": 43,
  "name": "Taxa de Dados Limpos",
  "iso25010": {
    "characteristic": "Adequação Funcional",
    "subcharacteristic": "Completude Funcional"
  },
  "fields": {
    "definition": "Definition: Mede a proporção de atributos ou registros que permanecem válidos, completos e consistentes após o processo de\nverificação e limpeza dos dados em um sistema blockchain.\nEssa métrica reflete o grau de integridade e utilidade dos\ndados processados antes de sua análise ou troca na rede.",
    "equation": "Clean Data Ratio = Atributos válidos após limpeza\nTotal de atributos analisados\nou, segundo o artigo:\nEUIDi2 = λ1(1 −V ′\n1j) + λ2(1 −V ′\n2j) + λ3(1 −V ′\n3j)\nonde V ′\n1j, V ′\n2j, V ′\n3j representam flags para valores nulos,\nanormais e tipos incorretos, e λk são os pesos associados\na cada fator de qualidade.\nMétricas\nAssociadas\nAccuracy of Summary Information; Data Utility Rate;\nData Integrity Ratio; Missing Value Rate\nAtributo\nRelacionado\nIntegridade dos Dados; Qualidade da Aplicação de Dados;\nConsistência de Atributos",
    "unit": "Proporção (0–1) ou Percentual (%)",
    "protocol": "1) Identificar o conjunto de dados submetido ao processo\nde limpeza e validação.\n2) Verificar valores nulos, anormais e tipos incorretos.\n3) Calcular a proporção de atributos válidos após a correção.\n4) Atribuir pesos aos diferentes tipos de erro conforme\nsua relevância (λk).\n5) Agregar os resultados em um índice de qualidade\nEUIDi2.\n117",
    "comment": "O artigo destaca que dados com alta taxa de validade\nsão essenciais para análises precisas em sistemas de negociação baseados em blockchain. O processo de limpeza\n(Algorithm 5) reduz ruídos e inconsistências, elevando\na confiança dos consumidores de dados e aumentando o\nvalor das transações no marketplace.\nInterpretação\ndo\nValor Medido\nValores próximos de 1 indicam alta qualidade e consistência dos dados. Valores baixos sugerem presença\nsignificativa de ruídos, valores nulos ou erros de tipo,\nreduzindo a confiabilidade do dataset.",
    "scale_type": "Razão",
    "precision": "Alta, dependente da exatidão dos mecanismos de verificação e dos pesos atribuídos aos fatores de erro.",
    "data_collection": "Automática / Experimental",
    "use_processes": "Avaliação de qualidade em marketplaces de dados; auditoria de datasets em sistemas blockchain; certificação de\nprovedores de dados descentralizados.",
    "objective": "Avaliar a eficácia dos processos de limpeza e verificação\nde dados em ambientes blockchain, garantindo que as\ninformações armazenadas ou comercializadas possuam\nalta qualidade, minimizando ruídos, valores nulos e tipos\nincorretos.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "measurement_tool": "Algoritmo de limpeza de dados (Algorithm 5 – Quality\nEvaluation); scripts Python; verificadores de consistência\nde schema; auditoria de qualidade on-chain.",
    "beneficiaries": "Analistas de dados; engenheiros de blockchain; operadores de marketplace de dados; pesquisadores em qualidade\ninformacional.",
    "references": "Wu, H., Zhang, X., & Liu, W. (2020). A Blockchain-Based Trading\nSystem for Big Data. IEEE Access, vol. 8, pp. 177642–177653.\n118"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 43"
  }
}