{
  "id": "t49",
  "table_no": 49,
  "name": "Sobrecarga de CPU",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Utilização de Recursos"
  },
  "fields": {
    "definition": "Definition: Mede o tempo adicional de processamento e uso\nda CPU necessário para interpretar políticas, executar\nregras de consenso ou resolver conflitos em um sistema\nblockchain. Representa o impacto computacional das\noperações realizadas no nó durante a validação e atualização do ledger.",
    "equation": "SobrecargaCPU = Tprocessamento_com_blockchain −Tprocessamento_base\nTprocessamento_base\n×100%\nou, alternativamente, em termos de uso de CPU:\nSobrecargaCPU = CPUuso_com_blockchain −CPUuso_base\nMétricas\nAssociadas\nTempo de resposta; Latência; Throughput; Uso de memória; Consumo de energia\nAtributo\nRelacionado\nDesempenho de execução; Eficiência computacional; Escalabilidade",
    "unit": "Porcentagem (%); ou tempo (ms/s)",
    "protocol": "1) Implantar o sistema blockchain com os módulos de\npolítica e consenso ativados.\n2) Executar cenários de transações e gravação no ledger\nsob carga controlada.\n3) Monitorar o uso médio e máximo de CPU por nó\ndurante o processo.\n4) Comparar os resultados com a execução sem o módulo\nblockchain (baseline).\n5) Calcular a diferença percentual para estimar a sobrecarga.\n129",
    "comment": "O estudo demonstra que a sobrecarga de CPU cresce\nconforme o número de regras de política aumenta, mas o\nmodelo proposto — com interpretação rápida de políticas\ne resolução dinâmica de conflitos — reduz significativamente o uso de CPU em comparação a abordagens\nestáticas. Essa otimização melhora a viabilidade da integração blockchain–IoT em dispositivos com recursos\nlimitados.\nInterpretação\ndo\nValor Medido\nValores mais baixos indicam maior eficiência do sistema e melhor adequação para dispositivos IoT. Valores\naltos podem indicar gargalos computacionais ou políticas\nde execução excessivamente complexas.",
    "scale_type": "Razão",
    "precision": "Depende da taxa de amostragem e da estabilidade da\ncarga de trabalho. Recomenda-se executar múltiplas\nmedições para suavizar picos de CPU.",
    "data_collection": "Automática (ferramentas de monitoramento de desempenho)",
    "use_processes": "Avaliação de eficiência de políticas dinâmicas; comparação entre frameworks blockchain-IoT; planejamento de\notimização de desempenho em nós validadores.",
    "objective": "Avaliar a eficiência computacional de mecanismos de\nexecução e controle em arquiteturas blockchain aplicadas\nà IoT. A métrica busca identificar quanto a adição de\ncamadas de segurança ou políticas dinâmicas afeta a\nutilização da CPU dos nós participantes.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "measurement_tool": "Monitor do sistema (ex.: top, htop); perfis de desempenho (perf); simuladores IoT; logs do nó blockchain.",
    "beneficiaries": "Engenheiros(as) de blockchain; Desenvolvedores(as) de\nIoT; Pesquisadores(as) em computação distribuída; Arquitetos(as) de sistemas embarcados.\nReferência\nR. Lu, M. Xu, J. Chen, et al. Fast Policy Interpretation and\nDynamic Conflict Resolution for Blockchain-Based IoT System.\nIEEE Internet of Things Journal, vol. 10, no. 15, pp. 13421–13433,\n2023.\n130"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 49"
  }
}