{
  "id": "t79",
  "table_no": 79,
  "name": "Nível de Centralização Interna de Serviços",
  "iso25010": {
    "characteristic": "Segurança",
    "subcharacteristic": "Integridade"
  },
  "fields": {
    "definition": "Definition: Mede o grau de dependência de uma blockchain\nou dApp em relação a serviços internos que operam de forma centralizada, tais como provedores de\nRPC, oráculos, indexadores, gateways ou mecanismos de\nautenticação controlados por uma única entidade. Essa\nmétrica quantifica o impacto da centralização embutida\nna infraestrutura sobre a confiabilidade e a descentralização do sistema.",
    "equation": "Cint = Ncentralizados\nNtotal\n,\nonde Ncentralizados é o número de serviços internos operados ou controlados centralmente, e Ntotal é o número\ntotal de serviços de suporte da rede (armazenamento,\nindexação, RPC, oráculos etc.).\nMétricas\nAssociadas\nGrau de descentralização; Probabilidade de ponto único\nde falha; Confiabilidade de nós; Sobrecarga de armazenamento; Dependência de terceiros\nAtributo\nRelacionado\nDescentralização; Disponibilidade; Resiliência; Transparência",
    "unit": "Razão adimensional (0–1) ou percentual (%)",
    "protocol": "1) Identificar todos os serviços internos utilizados pela\nrede (RPC, autenticação, indexação, oráculos, gateways).\n2) Classificar cada serviço como centralizado (controlado\npor uma entidade única) ou distribuído.\n3) Calcular Cint = Ncentralizados/Ntotal.\n4) Avaliar o impacto da centralização sobre a execução\nde contratos, consenso e acesso a dados.\n191",
    "comment": "O artigo demonstra que diversas blockchains e dApps\nmantêm forte dependência de componentes centralizados\nembutidos, como provedores de RPC e serviços de autenticação hospedados em nuvem. Essa dependência reduz\na resiliência da rede, cria pontos de falha e reintroduz\nvulnerabilidades típicas de sistemas centralizados. A\nmétrica permite quantificar esse grau de risco estrutural.\nInterpretação\ndo\nValor Medido\nValores altos (próximos de 1) indicam centralização\nsignificativa e maior vulnerabilidade a falhas e censura.\nValores baixos indicam que os serviços internos são\ndistribuídos, com maior descentralização e resiliência.",
    "scale_type": "Razão",
    "precision": "Depende da análise arquitetural e da transparência dos\nserviços utilizados. Alguns podem operar sob contratos\ndescentralizados, mas com controle real centralizado.",
    "data_collection": "Manual ou semiautomática (auditoria de arquitetura e\ndependências)",
    "use_processes": "Avaliação de descentralização de infraestrutura; auditoria\nde segurança; certificação de dApps; mitigação de riscos\nde dependência; monitoramento de conformidade com\nprincípios Web3.",
    "objective": "Avaliar a descentralização estrutural de uma blockchain, verificando o quanto sua operação depende de\nprovedores únicos ou controlados. Em ecossistemas que\nse autodenominam descentralizados, tais dependências\nconfiguram riscos de censura, manipulação, interrupções\ne vulnerabilidades de segurança.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "measurement_tool": "Análise de código-fonte; inspeção de contratos; auditoria\nde endpoints RPC; mapeamento de provedores de serviço;\nverificação de documentação técnica.",
    "beneficiaries": "Arquitetos de blockchain; engenheiros de segurança; auditores; desenvolvedores de dApps; pesquisadores em\ndescentralização.",
    "references": "Ali, M.; Al-Bassam, M.; Alrawi, O.; et al. Bad Apples: Understanding the Centralized Security Risks in Decentralized Ecosystems.\nProceedings of the ACM CCS, 2023. — O estudo evidencia que\nvárias blockchains públicas dependem de serviços internos controlados por poucas entidades (RPC, autenticação, oráculos, indexação),\nintroduzindo riscos estruturais de centralização.\n192"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 79"
  }
}