{
  "id": "t92",
  "table_no": 92,
  "name": "Desempenho da Rede",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Capacidade"
  },
  "fields": {
    "definition": "Definition: Mede o nível de eficiência global da rede blockchain\nna coordenação e transmissão de dados entre controladores e nós de comunicação. No contexto de redes ópticas\ndefinidas por software (SDON) integradas à blockchain,\no desempenho da rede reflete a capacidade do sistema\nem manter alta taxa de processamento, baixa latência e\nutilização equilibrada de recursos mesmo sob diferentes\ncargas de tráfego e cenários de falha.",
    "equation": "O Desempenho da Rede (DR) pode ser expresso de\nforma composta, considerando múltiplos fatores:\nDR = f(Tproc, Urec, Lctrl)\nonde Tproc é a taxa de processamento de serviços, Urec a\nutilização média de recursos (CPU, memória e largura\nde banda) e Lctrl a latência média de controle. Valores\nmais altos de Tproc e menores Urec e Lctrl indicam melhor\ndesempenho da rede.\nMétricas\nAssociadas\nLatência; Largura de Banda da Rede; Sobrecarga de\nRede; Tempo de Resposta; Taxa de Processamento de\nServiços\nAtributo\nRelacionado\nEscalabilidade; Robustez; Eficiência de Comunicação;\nTolerância a Falhas\n223",
    "unit": "Percentual de eficiência (%) ou índice composto adimensional",
    "protocol": "1) Configurar ambiente SDON distribuído com múltiplos\ncontroladores e nós interligados via blockchain.\n2) Definir cargas de tráfego variáveis e taxas de falha\nsimuladas.\n3) Medir a taxa de processamento (Tproc), a utilização\nde CPU, memória e largura de banda (Urec) e a latência\nmédia de controle (Lctrl).\n4) Calcular DR e comparar com arquiteturas de controle\ntradicionais (ex.: BFT, OpenFlow puro).\n5) Registrar desempenho sob condições normais e sob\nataque, analisando estabilidade e eficiência.",
    "comment": "O Desempenho da Rede em ambientes SDON baseados\nem blockchain representa o equilíbrio entre segurança e\neficiência. O estudo demonstra que a arquitetura proposta, com blockchain distribuída, reduz a latência de\ncontrole e melhora a utilização de recursos, mantendo\nalta confiabilidade durante ataques ou falhas. O uso\nde múltiplos controladores sincronizados pela blockchain\ngarante maior resiliência e coordenação entre os nós.\nInterpretação\ndo\nValor Medido\nValores altos de desempenho indicam rede eficiente,\ncom comunicação ágil, baixa sobrecarga e boa coordenação entre controladores. Valores baixos sugerem\ngargalos na comunicação, consumo excessivo de recursos\ne menor robustez da rede sob carga.",
    "scale_type": "Razão",
    "precision": "Moderada a alta, dependendo da granularidade da coleta e das ferramentas utilizadas para medir tempos e\nutilização de recursos.",
    "data_collection": "Experimental / Simulada",
    "use_processes": "Avaliação de desempenho de redes blockchain-SDON;\ncomparação entre arquiteturas de controle distribuído;\notimização de recursos de rede; análise de tolerância a\nfalhas e eficiência sob ataque.",
    "objective": "Avaliar a eficiência da comunicação e a robustez da rede\nblockchain distribuída aplicada a infraestruturas SDON.\nO objetivo é verificar se a integração da blockchain contribui para melhorar a confiabilidade, a coordenação entre\ncontroladores e o desempenho geral, reduzindo o tempo\nde resposta e otimizando a utilização de recursos.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "measurement_tool": "Hyperledger Fabric 1.2; Controladores SDON; Protocolo\nOpenFlow; Ferramentas de monitoramento (Wireshark,\nNetFlow, nmon).",
    "beneficiaries": "Engenheiros de redes ópticas; pesquisadores em blockchain aplicada; arquitetos de infraestrutura SDN/SDON;\nanalistas de desempenho e segurança de redes distribuídas.\n224",
    "references": "Yang, H.; Zhang, X.; Guo, S.; Yu, R.; Zhang, Y. BlockchainBased Secure Distributed Control for Software Defined Optical\nNetworking. China Communications, vol. 16, no. 6, pp. 46–54,\n2019. — Apresenta a métrica Network Performance para avaliar\na eficiência e confiabilidade de redes ópticas definidas por software\ncom controle distribuído via blockchain, considerando taxa de\nprocessamento, utilização de recursos e latência de controle.\n225"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 92"
  }
}