{
  "id": "t110",
  "table_no": 110,
  "name": "Razão de Sobrecarga",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Utilização de Recursos"
  },
  "fields": {
    "definition": "Mede a proporção de recursos adicionais (tempo,\nprocessamento, comunicação ou energia) consumidos por um protocolo de autenticação ou transação\nem relação à carga útil efetiva. Essa métrica avalia o\ncusto operacional adicional introduzido por mecanismos\nde segurança ou de blockchain em sistemas distribuídos\nde IoT.",
    "objective": "Quantificar o impacto dos mecanismos de autenticação,\ncriptografia e consenso sobre o desempenho global da\nrede e sobre a sustentabilidade do sistema. O objetivo\né identificar protocolos leves que mantenham segurança\nadequada com mínima sobrecarga de recursos.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "A razão de sobrecarga (Ro) é definida como:\nRo = Ctotal −Cbase\nCbase\n× 100\nonde Ctotal representa o custo total do sistema com o\nprotocolo blockchain (computacional, de comunicação ou\nenergético) e Cbase representa o custo sem o mecanismo\nadicional.\nMétricas\nAssociadas\nTempo de Operação; Consumo de Energia; Latência de\nComunicação; Custo Computacional; Throughput\nAtributo\nRelacionado\nEscalabilidade; Sustentabilidade; Eficiência Energética;\nCusto de Execução",
    "protocol": "1) Implementar o protocolo proposto de autenticação\nmútua baseado em blockchain leve (LBRMA) e protocolos de comparação (ECC, LDA).\n2) Medir o custo computacional, o tempo de comunicação\ne o consumo de energia em diferentes cenários de nós\nIoT.\n3) Calcular a sobrecarga total adicionada pelo protocolo\nblockchain usando a equação de Ro.\n4) Analisar o impacto da sobrecarga em função do número de nós e do volume de transações.\n263",
    "comment": "No estudo, o protocolo LBRMA reduziu significativamente a razão de sobrecarga em comparação com es-\nquemas convencionais baseados em ECC e autenticação\npesada. O uso de operações criptográficas otimizadas e\nestrutura leve de bloco permitiu reduzir o tempo de processamento e o consumo energético, mantendo segurança\nrobusta.\nInterpretação\ndo\nValor Medido\nValores baixos de Ro indicam alta eficiência e leve impacto de sobrecarga. Valores altos sugerem protocolos\npesados ou ineficientes, que comprometem o desempenho\ne o consumo sustentável de energia.",
    "scale_type": "Razão",
    "references": "Riyaz, M. A.; Jalil, Z.; Khan, F. A.; Rehman, M. H. U.; Kumar,\nN.; Alazab, M.; Alshamrani, S. S. A Lightweight Blockchain-Based\nRemote Mutual Authentication for AI-Empowered IoT Sustainable\nComputing Systems. IEEE Transactions on Sustainable Computing, 2023. — O estudo define a métrica Overhead Ratio para\nquantificar a sobrecarga introduzida por mecanismos de segurança\nblockchain em sistemas IoT, destacando reduções significativas\nobtidas com o protocolo LBRMA.\n264"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 110"
  }
}
