{
  "id": "t140",
  "table_no": 140,
  "name": "Risco de Integração com SDKs de Terceiros",
  "iso25010": {
    "characteristic": "Segurança",
    "subcharacteristic": "Confidencialidade"
  },
  "fields": {
    "definition": "Mede o nível de dependência e risco introduzido por\nSDKs e bibliotecas de terceiros integradas em aplicações\nblockchain (ex.: carteiras e DApps). Essa métrica avalia\no impacto potencial sobre a segurança, privacidade e\ndescentralização quando componentes externos acessam,\nprocessam ou transmitem dados sensíveis dos usuários.",
    "objective": "Identificar vulnerabilidades de centralização e vazamento\nde dados causadas pela inclusão de SDKs externos (ex.:\nde análise, notificações, verificação de identidade). A\nmétrica busca mensurar o quanto esses componentes\ncomprometem a descentralização e a integridade dos\necossistemas blockchain.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "RSDK = NSDKs_riscos\nNSDKs_totais\n× 100\nonde NSDKs_riscos representa o número de SDKs identificados como potencialmente vulneráveis (coleta de dados\nsensíveis, rastreamento, autenticação centralizada, etc.),\ne NSDKs_totais é o total de SDKs integrados na aplicação.\nMétricas\nAssociadas\nData Leakage Rate; Privacy Exposure Index; RPC Centralization Risk; App Dependency Ratio\nAtributo\nRelacionado\nPrivacidade de Dados; Segurança de Dependências;\nTransparência de Código-Fonte",
    "protocol": "1) Extrair o pacote APK da aplicação (ex.: carteira\nblockchain) e decompilá-lo utilizando ferramentas como\napktool ou jadx.\n2) Executar uma busca automatizada por pacotes de\nterceiros e nomes de domínios suspeitos em pastas smali.\n3) Classificar cada SDK como interno ou de terceiros,\nanalisando suas permissões e dependências de rede.\n4) Verificar se os SDKs coletam ou transmitem dados\nsensíveis (ex.: IDs de dispositivo, logs, informações de\nconta).\n5) Calcular o percentual de SDKs de risco (RSDK) e\ndocumentar exemplos e categorias de vulnerabilidade.\n323",
    "comment": "O uso de SDKs de terceiros é uma das principais fontes\nde centralização e exposição de dados em carteiras cripto.\nO estudo de Yan et al. (2023) identificou 29 SDKs de\nrisco em aplicativos amplamente utilizados, incluindo\nmódulos de análise, autenticação e notificações push.\nEssa dependência compromete a privacidade dos usuários\ne a integridade descentralizada da blockchain, gerando\npontos únicos de falha e rastreamento.\nInterpretação\ndo\nValor Medido\nValores altos (acima de 30%) indicam alto risco de\ncentralização e vazamento de dados devido ao uso de\nSDKs externos. Valores baixos (<10%) indicam bom\ncontrole de dependências e arquitetura descentralizada.",
    "scale_type": "Razão",
    "references": "Yan, J.; Guo, H.; Chen, T.; Zhao, Z.; & Li, J. (2023). Bad Apples: Understanding the Centralized Security Risks in Decentralized\nEcosystems. Proceedings of The Web Conference (WWW\n2023), 104–118.\n324"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 140"
  }
}
