{
  "id": "t152",
  "table_no": 152,
  "name": "Tempo da Transação",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Comportamento Temporal"
  },
  "fields": {
    "definition": "Tempo médio necessário para que uma transação seja\nvalidada e registrada de forma definitiva no blockchain.\nMede o intervalo entre o envio de uma transação e sua\nconfirmação na rede, refletindo o desempenho e a eficiência do consenso utilizado.",
    "objective": "Avaliar a eficiência temporal do mecanismo de consenso e\na escalabilidade da rede blockchain aplicada em sistemas\nde coleta de dados em MANETs. A métrica é essencial\npara medir a responsividade e a capacidade da rede em\nlidar com múltiplas transações sob diferentes cargas.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "Ttx = tconf −tenv, onde tenv é o instante de envio da transação e tconf é o instante em que a transação é confirmada\ne incluída no blockchain.\nMétricas\nAssociadas\nTransaction Throughput; Latência de Bloco; Taxa de\nConfirmação; Transaction Processing Rate; Transaction\nDelay\nAtributo\nRelacionado\nConsenso; Eficiência de Rede; Escalabilidade; Propagação de Blocos",
    "protocol": "1) Enviar um conjunto de transações e registrar os tempos\nde envio e confirmação.\n2) Calcular a diferença entre ambos para cada transação.\n3) Obter média, mediana e percentis (p50, p95, p99) do\ntempo de transação.\n4) Avaliar sob diferentes configurações de nós, número\nde blocos e frequência de tarefas.",
    "comment": "O tempo de transação aumenta conforme o número de\nblocos de referência (nb) cresce, devido à redução de\nmineradores ativos.\nEm contrapartida, a diminuição\ndesse parâmetro melhora o throughput, indicando uma\nrelação inversa entre tempo e taxa de processamento.\n349\n\nInterpretação\ndo\nValor Medido\nValores menores de tempo de transação indicam maior\neficiência e capacidade de resposta da rede. Tempos\nelevados refletem gargalos de comunicação, sobrecarga\nde validação ou limitações do consenso.",
    "scale_type": "Razão",
    "references": "Liu, G.; Dong, H.; Yan, Z. B4SDC: A Blockchain System for\nSecurity Data Collection in MANETs. IEEE DSN 2020. :contentReference[oaicite:0]index=0\n350"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 152"
  }
}
