{
  "id": "t155",
  "table_no": 155,
  "name": "Taxa de Chamadas Desconhecidas",
  "iso25010": {
    "characteristic": "Segurança",
    "subcharacteristic": "Integridade"
  },
  "fields": {
    "definition": "Mede a proporção de chamadas ou transações realizadas por nós que não são reconhecidas ou não\nencontram destino válido na rede. Essa métrica\navalia o comportamento anômalo de comunicação entre\nnós ou dispositivos em redes distribuídas baseadas em\nblockchain ou DAGs (como IOTA), indicando falhas de\nroteamento, sincronização ou ataques maliciosos.",
    "objective": "Avaliar a eficiência e segurança da comunicação\nentre nós, especialmente em sistemas distribuídos com\nvalidação paralela, como o Tangle (IOTA). Chamadas\npara destinos desconhecidos podem representar tentativas de comunicação com nós fora de sincronia, falhas na\npropagação de transações ou tentativas de ataque à rede.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "Urate = Nunknown\nNtotal\n,\nonde Nunknown é o número de chamadas que resultam\nem falha por destino desconhecido e Ntotal é o número\ntotal de chamadas realizadas na rede durante o intervalo\nanalisado.\nMétricas\nAssociadas\nTaxa de falhas de transação; Tempo médio de confirmação; Latência de rede; Taxa de reenvio; Disponibilidade\nde nós\nAtributo\nRelacionado\nRobustez de comunicação; Eficiência de roteamento; Segurança de mensagens; Consistência do ledger",
    "protocol": "1) Monitorar as chamadas ou transações geradas por\ncada nó durante o período [t0, t1].\n2) Registrar aquelas que falham devido a destino desconhecido, inexistente ou não sincronizado.\n3) Calcular Urate = Nunknown/Ntotal.\n4) Avaliar a variação temporal e correlação com carga de\nrede ou número de nós inativos.\n5) Verificar se há padrões que indiquem falhas sistêmicas\nou comportamento malicioso.\n355",
    "comment": "O artigo propõe um algoritmo distribuído e seguro para\nconfirmação de transações em IOTA, utilizando computação em nuvem. Durante a avaliação experimental, foi\nanalisada a taxa de chamadas a nós desconhecidos como\nindicador de estabilidade e eficiência do processo de propagação. Reduzir esse índice implica em comunicação\nmais confiável entre nós e menor desperdício de recursos\ncomputacionais.\nInterpretação\ndo\nValor Medido\nValores altos de Urate indicam problemas de sincronização, falhas de rede ou presença de nós inválidos. Valores\nbaixos indicam boa conectividade e comunicação eficiente entre os participantes.",
    "unit": "Percentual (%) ou razão adimensional (0–1)",
    "scale_type": "Razão",
    "precision": "Depende da granularidade da captura de logs e do número\nde nós monitorados. Logs incompletos podem subestimar\no valor real de chamadas desconhecidas.",
    "data_collection": "Automática (por meio de monitoramento de rede e logs\nde comunicação entre nós)",
    "measurement_tool": "Logs do cliente IOTA; dashboards de monitoramento\n(Prometheus, Grafana); simuladores de rede distribuída;\nferramentas de auditoria de mensagens.",
    "use_processes": "Avaliação da estabilidade de rede em sistemas DAG; diagnóstico de falhas de comunicação; validação de protocolos\nde confirmação distribuída; otimização de topologia de\nnós.",
    "beneficiaries": "Pesquisadores de redes distribuídas; engenheiros de blockchain/DAG; operadores de nós; analistas de segurança e\ndesempenho.",
    "references": "Alkhader, M.; Alsmadi, I.; Jararweh, Y. An Efficient Distributed\nand Secure Algorithm for Transaction Confirmation in IOTA Using\nCloud Computing. IEEE Access, 2022. — O estudo propõe um\nmodelo de confirmação distribuída para IOTA e utiliza a taxa\nde chamadas para desconhecido como métrica de avaliação da\nestabilidade e da confiabilidade da rede durante o processo de\nvalidação de transações.\n356"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 155"
  }
}