{
  "id": "t40",
  "table_no": 40,
  "name": "Taxa de Forks da Blockchain",
  "iso25010": {
    "characteristic": "Confiabilidade",
    "subcharacteristic": "Tolerância a Falhas"
  },
  "fields": {
    "definition": "Mede a proporção de blocos que resultam em bifurcações (forks) em relação ao total de blocos minerados\nna rede. Essa métrica indica a frequência com que ocorrem divergências temporárias ou permanentes entre nós\nsobre o estado atual da cadeia, refletindo a eficiência do\nprotocolo de consenso e da propagação de blocos.",
    "objective": "Avaliar a estabilidade e a eficiência do consenso\nem redes blockchain públicas. Altas taxas de bifurcação\nindicam atrasos na propagação de blocos, comportamento\negoísta de mineradores ou centralização em pools de\nmineração. Essa métrica também é usada para identificar\nriscos de ataques, desperdício de poder computacional e\ndegradação do throughput da rede.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "Frate = Nfork\nNtotal\n,\nonde Nfork representa o número total de blocos que\nresultaram em bifurcações (incluindo forks reconhecidos\ne não reconhecidos) e Ntotal é o número total de blocos\nminerados no mesmo período.\nMétricas\nAssociadas\nTempo de confirmação; Taxa de blocos órfãos (orphan\nrate); Entrega de blocos; Taxa de consenso; Throughput\nAtributo\nRelacionado\nEficiência do consenso; Integridade da cadeia; Distribuição geográfica de mineradores; Taxa de blocos vazios",
    "protocol": "1) Observar todos os blocos minerados na rede durante\no período [t0, t1].\n2) Identificar bifurcações (blocos não pertencentes à cadeia principal, mas válidos).\n3) Classificar cada fork como reconhecido (uncle) ou não\nreconhecido.\n4) Calcular Frate = Nfork/Ntotal e registrar a frequência\npor tipo e comprimento da bifurcação.\n5) Analisar padrões temporais e correlação com localização dos mineradores ou políticas de pools.\n109",
    "comment": "A Taxa de Forks da Blockchain reflete a competição\nentre mineradores e o desempenho da propagação de\nblocos. O estudo da rede Ethereum mostrou que 7,19%\ndos blocos resultaram em bifurcações — sendo 6,97%\nreconhecidos (uncles) e 0,22% não reconhecidos — e que\na maioria (97%) possuía comprimento 1. O aumento\nrecente dessa taxa está associado à redução do tempo\nmédio entre blocos e à centralização em grandes pools de\nmineração, que provocam atrasos regionais e bifurcações\nsimultâneas.\nInterpretação\ndo\nValor Medido\nValores baixos indicam estabilidade e sincronização\nadequada entre nós. Valores altos sugerem congestionamento, latência na propagação de blocos ou comporta-\nmento egoísta (como mineração simultânea de blocos na\nmesma altura). Valores acima de 5% podem representar\ndesperdício significativo de recursos e vulnerabilidade a\nataques.",
    "unit": "Percentual (%) ou razão adimensional (0–1)",
    "scale_type": "Razão",
    "precision": "Depende da abrangência da coleta e da visibilidade dos\nblocos não incluídos na cadeia principal. A sincronização\nde relógio e a dispersão geográfica dos nós medidores\nafetam a precisão.",
    "data_collection": "Automática (por meio de clientes instrumentados e logs\nde rede)",
    "measurement_tool": "Clientes modificados (ex.: Geth instrumentado); exploradores de blocos (Etherscan, Etherchain); análise de logs\nP2P; ferramentas de mineração distribuída.",
    "use_processes": "Avaliação da eficiência de consenso; diagnóstico de propagação de blocos; detecção de comportamento egoísta\nde pools; estudo de descentralização e segurança de rede.",
    "beneficiaries": "Pesquisadores de consenso; engenheiros de rede blockchain; operadores de pools de mineração; auditores de\nsegurança e confiabilidade.",
    "references": "Silva, P.; Vavřička, D.; Barreto, J.; Matos, M. Impact of GeoDistribution and Mining Pools on Blockchains: A Study of Ethe-\nreum. IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), 2020. — O estudo identificou 485 forks\nnão reconhecidos em 216.656 blocos, mostrando aumento da taxa\nde bifurcação e ocorrência de one-miner forks, onde um único\nminerador cria múltiplos blocos na mesma altura, explorando o\nsistema de recompensas de uncles.\n110"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 40"
  }
}