{
  "id": "t41",
  "table_no": 41,
  "name": "Índice de Saúde da Blockchain",
  "iso25010": {
    "characteristic": "Confiabilidade",
    "subcharacteristic": "Disponibilidade"
  },
  "fields": {
    "definition": "Mede o estado geral de estabilidade, segurança e\ndesempenho de uma blockchain, considerando três\ndimensões principais: (i) proporção de poder computacional proveniente de mineradores honestos, (ii) latência\nmédia de processamento de transações e (iii) estabilidade do preço de consumo (taxa mínima de inclusão\nem bloco). Esses fatores refletem a robustez técnica e a\nsustentabilidade econômica da rede.",
    "objective": "Avaliar se a blockchain opera de forma segura, eficiente e\njusta em cenários maduros, nos quais as recompensas de\nbloco se tornam irrelevantes e o sistema depende apenas\ndas taxas de transação. O índice permite diagnosticar o\nequilíbrio entre segurança (mineração honesta), desempenho (baixa latência) e acessibilidade econômica (taxas\nestáveis).\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "O índice pode ser expresso como uma função composta\nde três parâmetros:\nISB = f(Ph, Lp, Vc), onde:\nPh = proporção de poder de mineração honesto;\nLp = latência média de processamento (em blocos);\nVc = variância do preço de consumo (taxa mínima).\nA saúde aumenta com Ph alto, Lp baixo e Vc reduzido.\nMétricas\nAssociadas\nTaxa de Mineração Honesta; Latência de Processamento;\nPreço de Consumo; Índice de Justiça; Taxa de Participação de Mineradores\nAtributo\nRelacionado\nEstabilidade da rede; Equilíbrio econômico; Sustentabilidade do protocolo; Desempenho da camada de consenso\n111",
    "protocol": "1) Medir o percentual de poder computacional honesto\n(Ph) a partir da proporção de blocos válidos.\n2) Calcular o tempo médio entre submissão e confirmação\nde transações (Lp).\n3) Determinar a variância temporal das taxas mínimas\nexigidas para inclusão em bloco (Vc).\n4) Normalizar os valores e combinar conforme pesos\ndefinidos (w1, w2, w3):\nISB = w1Ph −w2Lp −w3Vc.",
    "comment": "O Índice de Saúde da Blockchain expressa o equilíbrio\nentre segurança, desempenho e estabilidade econômica.\nNo modelo Transaction-Fee-Only, a redução das recompensas de bloco pode deteriorar a saúde da rede, pois\nreduz a mineração honesta e aumenta a latência e a volatilidade das taxas. O protocolo BitcoinF restabelece o\nequilíbrio ao impor taxas mínimas e ordenação justa de\ntransações, mantendo a rede segura e economicamente\nviável.\nInterpretação\ndo\nValor Medido\nValores altos indicam uma blockchain saudável, com\nalta participação honesta, baixa latência e estabilidade\nde taxas; valores baixos indicam risco de centralização, lentidão e instabilidade econômica, comprometendo\nsegurança e confiabilidade.",
    "scale_type": "Intervalar / Razão",
    "references": "Siddiqui, S.; Vanahalli, G.; Gujar, S. BitcoinF: Achieving Fairness\nfor Bitcoin in Transaction-Fee-Only Model. Proceedings of the\nIEEE International Conference on Distributed Computing Systems\n(ICDCS), 2020. — Define o conceito de Health of a Blockchain\ncomo função da honestidade dos mineradores, da latência e da\nestabilidade de taxas, propondo o protocolo BitcoinF para manter\na rede saudável em condições de maturidade.\n113"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 41"
  }
}
