{
  "id": "t48",
  "table_no": 48,
  "name": "Tempo de Consenso",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Comportamento Temporal"
  },
  "fields": {
    "definition": "Tempo necessário para que os nós participantes de um mecanismo de consenso em uma rede blockchain alcancem um acordo válido sobre a ordenação e a confirmação de transações. Representa o intervalo entre o envio de uma proposta e o commit final no livro-razão.",
    "objective": "Avaliar o desempenho temporal de mecanismos de consenso, especialmente em redes permissionadas, apoiando decisões sobre políticas de endosso, configuração de nós e planejamento de serviços blockchain com equilíbrio entre desempenho, confiabilidade e custo operacional.",
    "equation": "O tempo de consenso pode ser estimado como a soma das principais etapas do processo:\nTc = Treq + Tendorsement + Tordering + Tcommit,\nonde Treq é o tempo de envio da solicitação, Tendorsement o tempo de endosso pelos nós exigidos pela política, Tordering o tempo de ordenação em blocos e Tcommit o tempo de validação e escrita no ledger.",
    "comment": "Políticas de endosso mais restritivas aumentam o tempo de consenso, pois exigem a participação de mais nós antes da confirmação. Políticas mais flexíveis reduzem o tempo, mas podem diminuir a tolerância a falhas. Configurações do serviço, como número de nós e taxa de falhas, influenciam diretamente essa métrica.",
    "scale_type": "Razão",
    "protocol": "1) Definir o mecanismo de consenso e a plataforma blockchain utilizada.\n2) Configurar as políticas de endosso ou quórum (ex.: AND, OR, K-out-of-N).\n3) Submeter transações e registrar o instante de envio da proposta.\n4) Registrar o instante de commit final no livro-razão.\n5) Calcular o tempo de consenso e reportar estatísticas como média e percentis (p50, p95, p99).",
    "references": "1) A model-based approach for planning blockchain service provisioning"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 48"
  }
}
