{
  "id": "t53",
  "table_no": 53,
  "name": "Taxa de Acesso a Dados",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Capacidade"
  },
  "fields": {
    "definition": "Mede a velocidade com que dados podem ser compartilhados e recuperados em um sistema blockchain\ndurante operações de autenticação, criptografia e verificação. Representa o desempenho do sistema na execução\nde requisições de leitura e escrita de dados com segurança\ne integridade.",
    "objective": "Avaliar a eficiência de acesso e compartilhamento\nde dados em sistemas baseados em blockchain. Uma\nalta taxa de acesso indica que o sistema mantém boa\nperformance mesmo sob múltiplas requisições simultâneas, assegurando confiabilidade e estabilidade — espe-\ncialmente em ambientes de computação em nuvem com\ngrande volume de dados.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "TAD = Ndados_acessados\nTexecução\nonde Ndados_acessados é o número de dados lidos ou compartilhados e Texecução é o tempo total gasto em operações\nde criação de bloco, criptografia, descriptografia e verificação de autenticação.\nMétricas\nAssociadas\nLatência; Taxa de entrega de mensagens; Consumo de\nenergia; Taxa de sucesso do consenso; Throughput\nAtributo\nRelacionado\nDesempenho de leitura e escrita; Tempo de resposta;\nEficiência de transmissão de dados",
    "protocol": "1) Configurar o ambiente de nuvem com o protocolo\nBC-IAS baseado em blockchain.\n2) Executar cenários de leitura e gravação de dados sob\ndiferentes volumes de usuários.\n3) Registrar tempos de criação de bloco, autenticação e\ncriptografia.\n4) Calcular o número de acessos bem-sucedidos por unidade de tempo.\n5) Comparar os resultados com outros modelos (ex.:\nIECCA, ACOMKSV, PFP, FS).\n137",
    "comment": "O estudo demonstrou que o protocolo BC-IAS apresentou\numa taxa de acesso superior às abordagens anteriores, mantendo alto desempenho em ambientes de alta\ndemanda. Essa eficiência se deve à integração de autenticação com curva elíptica avançada (HECC) e controle\nde acesso via smart contracts, que reduzem o tempo de\nverificação e melhoram a escalabilidade.\nInterpretação\ndo\nValor Medido\nValores altos indicam alta eficiência e estabilidade do\nsistema; valores baixos podem refletir gargalos em\nautenticação, criptografia ou latência de rede.",
    "unit": "Dados por segundo (req/s, trans/s)",
    "scale_type": "Razão",
    "precision": "Depende da amostragem temporal e da carga de rede.\nRecomenda-se medições com múltiplas repetições e cenários de carga variável.",
    "data_collection": "Automática (via logs do sistema e medições de desempenho)",
    "measurement_tool": "Simuladores de nuvem;\nferramentas de benchmark\n(CloudSim, JMeter); logs de desempenho do protocolo\nBC-IAS.",
    "use_processes": "Avaliação de desempenho de protocolos de autenticação\nblockchain; comparação entre modelos de acesso seguro;\notimização de compartilhamento de dados em ambientes\nde nuvem.",
    "beneficiaries": "Pesquisadores(as) em blockchain e segurança; Engenheiros(as) de nuvem; Desenvolvedores(as) de sistemas dis-\ntribuídos; Analistas de desempenho.\nReferência\nS. Navin Prasad, C. Rekha. Blockchain-based IAS Protocol to\nEnhance Security and Privacy in Cloud Computing. Measurement:\nSensors, vol. 28, 100813, 2023.\n138"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 53"
  }
}