{
  "id": "t57",
  "table_no": 57,
  "name": "Taxa de Acerto de Cache",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Utilização de Recursos"
  },
  "fields": {
    "definition": "Mede a proporção de acessos a dados que são atendidos diretamente por caches em memória, em vez de requererem acesso a armazenamento persistente (disco). Em sistemas blockchain, a métrica reflete a eficácia dos mecanismos de cache utilizados para acelerar a execução de transações e a verificação de estado.",
    "objective": "Avaliar a eficiência dos mecanismos de cache na redução de custos computacionais e de I/O durante a execução de transações blockchain. Uma alta taxa de acerto de cache indica melhor aproveitamento da memória e menor dependência de acessos ao disco, contribuindo para maior desempenho e escalabilidade dos nós.",
    "equation": "CHR = N_hit / (N_hit + N_miss),\nonde N_hit representa o número de acessos atendidos pelo cache e N_miss o número de acessos que resultaram em leitura a partir do armazenamento persistente.",
    "protocol": "1) Instrumentar o cliente blockchain para registrar acessos a estruturas de estado (ex.: state trie).\n2) Executar transações representativas da carga real do sistema.\n3) Registrar eventos de cache hit e cache miss durante a execução.\n4) Calcular a taxa de acerto de cache (CHR).\n5) Analisar a correlação entre CHR, latência de execução e custo computacional.\n6) Comparar resultados entre diferentes tipos de cache ou configurações de hardware.",
    "comment": "O estudo empírico sobre o mecanismo de gas do Ethereum mostra que caches em memória podem reduzir significativamente o tempo de execução de opcodes que acessam o estado, como BALANCE e EXTCODESIZE. Entretanto, a eficácia do cache depende do padrão de acesso ao estado, sendo menor quando há baixa localidade de referência, como em acessos frequentes a contas distintas.",
    "unit": "Proporção (0–1) ou percentual (%)",
    "scale_type": "Razão",
    "precision": "Dependente da instrumentação do cliente e da granularidade do registro de acessos ao cache.",
    "data_collection": "Automática (instrumentação do cliente blockchain e logs de execução)",
    "measurement_tool": "Instrumentação do cliente Ethereum; logs de cache hit/miss; ferramentas de tracing (ex.: LTTng); scripts de análise estatística.",
    "use_processes": "Avaliação de desempenho de clientes blockchain; otimização de execução de contratos inteligentes; análise de impacto de I/O; comparação de arquiteturas e configurações de hardware.",
    "beneficiaries": "Desenvolvedores de clientes blockchain; engenheiros de desempenho; pesquisadores em sistemas distribuídos; operadores de nós.",
    "references": "Yang, R.; Murray, T.; Rimba, P.; Parampalli, U. Empirically Analyzing Ethereum’s Gas Mechanism. IEEE Access / arXiv, 2019. — O estudo analisa o impacto de caches em memória na execução de opcodes e mede explicitamente taxas de acerto de cache e sua relação com desempenho."
  },
  "source": {
    "pdf": "Empirically_Analyzing_Ethereum_Gas_Mechanism.pdf",
    "table": "Tabela 57"
  }
}