{
  "id": "t69",
  "table_no": 69,
  "name": "Nível de Tolerância a Falhas",
  "iso25010": {
    "characteristic": "Confiabilidade",
    "subcharacteristic": "Tolerância a Falhas"
  },
  "fields": {
    "definition": "Mede o grau de capacidade do sistema blockchain\nde continuar executando corretamente operações\ne transações na presença de falhas de nós, controladores ou ataques. Representa a resiliência do\nsistema em manter o consenso e o funcionamento normal,\nmesmo sob degradação parcial da rede.",
    "objective": "Avaliar a robustez e continuidade operacional do\nsistema distribuído frente a falhas. O nível de tolerância\na falhas indica o quanto a arquitetura descentralizada\n(como a baseada em Hyperledger) é capaz de preservar a\nintegridade do controle e a consistência dos dados mesmo\ndiante de falhas de componentes.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "A métrica é avaliada em função do número de falhas\ntoleradas (f) em relação ao limite máximo aceitável\n(fmax):\nNTF =\nf\nfmax\n, com NTF ≤1.\nPodetambémsermedidaindiretamentepelaproporçãodeoperaçõesconcluída\nMétricas\nAssociadas\nTaxa de requisições falhas; Latência de recuperação;\nDisponibilidade; Eficiência de consenso; Robustez da\nrede\nAtributo\nRelacionado\nRecuperação de falhas; Confiabilidade operacional; Continuidade de serviço; Desempenho de consenso",
    "protocol": "1) Implementar uma rede blockchain distribuída (ex.:\nHyperledger Fabric) com múltiplos controladores.\n2) Introduzir falhas controladas em nós ou controladores\npara simular condições adversas.\n3) Medir quantos nós podem falhar antes que o sistema\ndeixe de operar corretamente.\n4) Calcular NTF = f/fmax.\n5) Analisar a proporção de transações bem-sucedidas sob\ndiferentes níveis de falha.\n170",
    "comment": "O artigo demonstra que a introdução da blockchain no\ncontrole de redes ópticas (SDON) aumenta significativamente a tolerância a falhas, permitindo que a rede\ncontinue operando mesmo quando alguns controladores\nfalham. A arquitetura distribuída elimina o ponto único\nde falha e assegura consistência e confiabilidade durante\no consenso.\nInterpretação\ndo\nValor Medido\nValores altos de NTF indicam maior robustez e resiliência do sistema, mantendo funcionalidade mesmo\nsob falhas. Valores baixos sugerem vulnerabilidade ou\nincapacidade de recuperação adequada.",
    "unit": "Razão adimensional (0–1) ou percentual (%)",
    "scale_type": "Razão",
    "precision": "Depende do controle experimental e da detecção precisa\nde falhas e recuperações. A variação de rede e tempo de\nresposta pode afetar a medição.",
    "data_collection": "Experimental (simulações e logs de execução)",
    "measurement_tool": "Hyperledger Fabric 1.2; Docker Swarm; controladores\nSDON (OpenFlow); simuladores de falhas; Prometheus;\nWireshark.",
    "use_processes": "Avaliação de confiabilidade de redes SDON; validação de\narquiteturas distribuídas; testes de resiliência; análise de\nfalhas em sistemas blockchain.",
    "beneficiaries": "Engenheiros de rede; pesquisadores em blockchain distribuído; analistas de desempenho; arquitetos de sistemas\ncríticos.",
    "references": "Yang, H.; Xu, S.; Zhang, W.; et al. Blockchain-based Secure Distributed Control for Software Defined Optical Networking. China\nCommunications, 2019. — O estudo propõe um controle distribuído\nbaseado em blockchain que mantém operação contínua mesmo sob\nfalhas de controladores, demonstrando alto nível de tolerância a\nfalhas e aumento da confiabilidade do sistema SDON.\n171"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 69"
  }
}