{
  "id": "t131",
  "table_no": 131,
  "name": "Consumo de Dados",
  "iso25010": {
    "characteristic": "Eficiência de Desempenho",
    "subcharacteristic": "Utilização de Recursos"
  },
  "fields": {
    "definition": "Mede a quantidade de dados transmitidos e armazenados por um sistema blockchain durante sua operação, considerando o tráfego de rede gerado, o tamanho das transações, o crescimento do ledger e os dados auxiliares necessários para validação e verificação de informações.",
    "objective": "Avaliar o impacto do volume de dados sobre a eficiência e a escalabilidade de sistemas blockchain. Em soluções baseadas em revogação de certificados, o consumo de dados reflete o custo de manter informações de revogação distribuídas, atualizadas e verificáveis por todos os participantes da rede.",
    "equation": "DC = D_tx + D_ctrl + D_ledger,\nonde D_tx representa o volume de dados das transações, D_ctrl os dados de controle e sinalização da rede, e D_ledger o crescimento do armazenamento distribuído ao longo do tempo.",
    "protocol": "1) Definir o cenário de operação (ex.: emissão e revogação de certificados).\n2) Medir o tamanho médio das transações blockchain.\n3) Monitorar o tráfego de rede gerado durante a propagação de blocos.\n4) Avaliar o crescimento do ledger ao longo do tempo.\n5) Calcular o consumo total de dados (DC).\n6) Comparar os resultados com abordagens tradicionais (ex.: CRL e OCSP).",
    "comment": "O estudo baseado em blockchain para revogação de certificados demonstra que, embora haja aumento no consumo de dados em comparação a soluções centralizadas, o overhead é compensado pela eliminação de pontos únicos de falha e pelo aumento da transparência e disponibilidade. O consumo de dados está fortemente associado ao número de certificados revogados e à frequência de atualização.",
    "unit": "Bytes, KB, MB ou GB",
    "scale_type": "Razão",
    "precision": "Dependente da precisão da medição de tráfego de rede e do monitoramento do crescimento do ledger.",
    "data_collection": "Automática / Experimental (monitoramento de tráfego e armazenamento)",
    "measurement_tool": "Wireshark; ferramentas de monitoramento de rede; logs do cliente blockchain; scripts de análise de tamanho de blocos e transações.",
    "use_processes": "Avaliação de escalabilidade; comparação entre modelos de revogação; análise de overhead de comunicação; planejamento de infraestrutura blockchain.",
    "beneficiaries": "Engenheiros de blockchain; arquitetos de segurança; administradores de infraestrutura; pesquisadores em sistemas distribuídos.",
    "references": "Khan, M. A.; Salah, K. A Blockchain-Based Certificate Revocation. IEEE Access, 2018."
  },
  "raw_fields": {
    "Atributo Nome (Título)": "Consumo de Dados (Data Consumption)",
    "Palavras-chave / Alias": "Data consumption; Network overhead; Bandwidth usage; Ledger growth",
    "Definição do Atributo": "Mede o volume de dados transmitidos e armazenados por um sistema blockchain durante sua operação.",
    "Objetivo / Motivação": "Avaliar o impacto do uso de blockchain sobre tráfego de rede e armazenamento, especialmente em aplicações de segurança digital.",
    "Característica": "Eficiência de Desempenho",
    "Sub-característica": "Utilização de Recursos",
    "Equação": "DC = D_tx + D_ctrl + D_ledger",
    "Protocolo": "Monitorar tráfego de rede, tamanho das transações e crescimento do ledger durante a operação do sistema.",
    "Comentário": "Soluções blockchain tendem a consumir mais dados que abordagens centralizadas, porém oferecem maior disponibilidade e resistência a falhas.",
    "Unidade": "MB ou GB",
    "Tipo de Escala": "Razão",
    "Precisão": "Dependente da instrumentação e do ambiente experimental.",
    "Tipo de Coleta de Dados": "Automática / Experimental",
    "Ferramenta de Medição": "Ferramentas de monitoramento de rede e armazenamento.",
    "Processos de Uso Potenciais": "Análise de escalabilidade; planejamento de infraestrutura; comparação de soluções de revogação.",
    "Beneficiários Potenciais": "Desenvolvedores; pesquisadores; operadores de sistemas.",
    "Referências": "Khan & Salah, A Blockchain-Based Certificate Revocation, IEEE Access, 2018."
  },
  "source": {
    "pdf": "A_blockchain_based_certificate_revocation.pdf",
    "table": "Tabela 131 (adaptada)"
  }
}
