{
  "id": "t76",
  "table_no": 76,
  "name": "Taxa de Conflito em Grupo",
  "iso25010": {
    "characteristic": "Confiabilidade",
    "subcharacteristic": "Tolerância a Falhas"
  },
  "fields": {
    "definition": "Mede o grau de dependência coletiva entre transações em um bloco blockchain, representando a fração\nde transações que pertencem ao maior componente conectado no grafo de dependência de transações (Transaction\nDependency Graph — TDG). Um group conflict rate\nmais baixo indica maior potencial de execução paralela,\nrefletindo o nível de concorrência intrínseco disponível\nna camada de execução da blockchain.",
    "objective": "Quantificar o potencial de paralelização da execução de\ntransações em blocos blockchain. Esta métrica permite\nestimar o quanto a execução sequencial limita o desempenho e, portanto, fornece subsídios para otimizações de\nthroughput baseadas em concurrency-aware scheduling.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "O group conflict rate é definido como:\nGCR = LCC_size\nNtx\n,\nonde LCC_size representa o número de transações pertencentes ao maior componente conectado no TDG (Lar-\ngest Connected Component) e Ntx é o número total de\ntransações do bloco.\nUm valor menor de GCR implica maior concorrência e\npotencial de execução paralela.\nMétricas\nAssociadas\nSingle Transaction Conflict Rate; Execution Speed-Up;\nTransaction Concurrency Ratio; Block Size; Throughput\nAtributo\nRelacionado\nConcurrency Level; Parallelism Potential; Transaction\nDependency Density; Execution Bottleneck Index\n184",
    "protocol": "1) Representar o bloco como um grafo de dependência\nde transações (TDG), no qual cada nó é uma transação\ne cada aresta indica dependência de leitura/escrita entre\ntransações.\n2) Identificar os componentes conectados via busca em\nlargura (BFS).\n3) Determinar o tamanho do maior componente conectado (LCC_size).\n4) Calcular GCR = LCC_size/Ntx.\n5) Repetir o cálculo para todos os blocos analisados,\nponderando os resultados pelo número de transações ou\nconsumo de gás (gas-weighted).",
    "comment": "O Group Conflict Rate captura conflitos coletivos que\nlimitam o paralelismo em nível de bloco. Nos resultados empíricos, blockchains baseadas em contas (como\nEthereum) apresentaram GCR médio de cerca de 20%,\nenquanto UTXO-based blockchains (como Bitcoin) tiveram menos de 1%. Essa diferença mostra que o modelo\nde dados impacta fortemente o potencial de execução\nparalela. A métrica também revelou que blockchains\ncom maior número de transações por bloco tendem a\napresentar menor GCR, indicando maior paralelismo\npossível.\nInterpretação\ndo\nValor Medido\nValores baixos indicam alto potencial de concorrência\n(maior eficiência de execução paralela); valores altos sugerem forte acoplamento entre transações, demandando\nexecução sequencial e limitando o ganho de desempenho.",
    "unit": "Proporção adimensional (0 a 1)",
    "scale_type": "Razão",
    "precision": "A precisão depende da construção correta do grafo de\ndependências (TDG) e da inclusão de transações internas.\nResultados podem variar conforme o modelo de dados\n(UTXO vs Account-based) e a granularidade da análise.",
    "data_collection": "Automática (via análise estrutural de blocos históricos)",
    "measurement_tool": "BigQuery datasets públicos;\nclientes de nós Ethereum/Bitcoin (geth, bitcoind); algoritmos de análise de\ngrafos (BFS/DFS); scripts SQL e UDFs para extração\nde componentes conectados.",
    "use_processes": "Avaliação de paralelismo potencial em blockchains; modelagem de execução concorrente; estimativa de speed-up\nteórico; otimização de motores de execução e sharding;\nanálise de escalabilidade de blockchains públicas.\n185",
    "beneficiaries": "Pesquisadores em escalabilidade blockchain; desenvolvedores de VMs e runtimes paralelos; engenheiros de\ndesempenho; arquitetos de consenso e execução; projetistas de sistemas de alto throughput.",
    "references": "Reijsbergen, D.; Dinh, T. T. A. On Exploiting Transaction Concurrency to Speed Up Blockchains. Proceedings of the 2020 IEEE\n40th International Conference on Distributed Computing Systems\n(ICDCS). — Introduz o conceito de Group Conflict Rate como\nmétrica de concorrência baseada no tamanho relativo do maior\ncomponente conectado (LCC) em blocos blockchain, demonstrando\nempiricamente que o uso dessa métrica permite prever ganhos de\naté 6× na velocidade de execução ao explorar paralelismo transacional.\n186"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 76"
  }
}