{
  "id": "t94",
  "table_no": 94,
  "name": "Garantia de Não Repúdio",
  "iso25010": {
    "characteristic": "Segurança",
    "subcharacteristic": "Não Repúdio"
  },
  "fields": {
    "definition": "Capacidade do sistema blockchain de garantir que uma ação ou transação registrada não possa ser negada posteriormente pelo seu autor. Essa garantia é obtida por meio de mecanismos criptográficos que vinculam de forma verificável cada operação a uma entidade específica.",
    "objective": "Avaliar se o sistema blockchain oferece mecanismos suficientes para assegurar a autoria e a responsabilidade sobre transações, eliminando a possibilidade de negação posterior e aumentando a confiança, a auditabilidade e a validade das operações registradas.",
    "equation": "NR = presença de mecanismos criptográficos de autoria verificável\nNR = 1, se transações são assinadas e registradas de forma imutável;\nNR = 0, caso contrário.",
    "comment": "A garantia de não repúdio é essencial em aplicações sensíveis, como leilões eletrônicos, contratos digitais e sistemas financeiros. Quando presente, assegura que participantes não possam negar ações previamente executadas, reduzindo disputas e aumentando a confiança no sistema. A ausência desse mecanismo compromete a responsabilização e pode gerar conflitos legais ou operacionais.",
    "scale_type": "Nominal",
    "protocol": "1) Verificar se as transações utilizam assinaturas digitais baseadas em criptografia assimétrica.\n2) Confirmar que cada transação está vinculada de forma única a uma chave pública.\n3) Avaliar se os registros são armazenados de maneira imutável na blockchain.\n4) Testar se a autoria da transação pode ser verificada de forma independente.\n5) Registrar NR = 1 quando todas as condições forem atendidas; caso contrário, NR = 0.",
    "references": "1) A Blockchain-Based Sealed-Bid e-Auction Scheme with Smart Contract and Zero-Knowledge Proof"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 94"
  }
}
