{
  "id": "t97",
  "table_no": 97,
  "name": "Número de Blocos Perdidos",
  "iso25010": {
    "characteristic": "Confiabilidade",
    "subcharacteristic": "Tolerância a Falhas"
  },
  "fields": {
    "definition": "Mede o número total de blocos que não foram entregues, propagados ou confirmados corretamente\nentre os nós de uma rede blockchain. Essa métrica reflete\nfalhas de transmissão, inconsistências de consenso ou perdas causadas por sobrecarga de rede, desconexão de nós\nou ataques. É essencial para avaliar a confiabilidade\nda infraestrutura blockchain, especialmente em sistemas\nsensíveis como aplicações de saúde remota.",
    "objective": "Quantificar o nível de confiabilidade e estabilidade da\nrede blockchain em ambientes distribuídos. O objetivo é\nminimizar perdas de blocos, que comprometem a consistência do ledger e a integridade das transações, garan-\ntindo assim comunicação segura e sincronização confiável\nentre nós validadores.\nModelo\nde\nQualidade\nISO/IEC 25010",
    "equation": "A métrica pode ser expressa como:\nBlost = Nexpected −Nreceived\nonde Blost representa o número de blocos perdidos,\nNexpected o número total de blocos esperados para propagação e Nreceived o número de blocos efetivamente recebi-\ndos e registrados pelos nós.\nMétricas\nAssociadas\nQuantidade de Blocos Encaminhados; Latência de Propagação; Taxa de Sucesso de Transmissão; Desempenho\nda Rede; Integridade do Ledger\nAtributo\nRelacionado\nRobustez da Rede; Disponibilidade; Confiabilidade de\nComunicação; Consistência de Dados",
    "protocol": "1) Implantar rede blockchain simulada ou real e monitorar a propagação de blocos entre nós.\n2) Registrar o número total de blocos transmitidos\n(Nexpected) e o número efetivamente recebidos (Nreceived).\n3) Calcular Blost = Nexpected −Nreceived.\n4) Analisar as causas de perda (falhas de rede, desconexões, conflitos de consenso ou ataques).\n5) Avaliar a relação entre perdas e desempenho geral da\nrede blockchain.\n234",
    "comment": "A Quantidade de Blocos Perdidos é uma métrica crítica\npara sistemas blockchain aplicados à área da saúde, onde\na integridade e a disponibilidade dos dados são essenciais. O artigo demonstra que, ao aplicar uma arquitetura\ndescentralizada de identidade (Health-ID) com canais\nseguros e consenso otimizado, as perdas de blocos diminuem significativamente, aumentando a confiabilidade\nda transmissão de registros médicos.\nInterpretação\ndo\nValor Medido\nValores baixos de blocos perdidos indicam uma rede\nestável e confiável. Valores altos apontam problemas\nde sincronização, congestionamento, falhas de rede ou\ninconsistências de consenso.",
    "scale_type": "Razão",
    "references": "Kaur, R.; Garg, S.; Kumar, N.; Hossain, M.S.; Ghoneim, A.; Alrashoud, M. Health-ID: A Blockchain-Based Decentralized Identity\nManagement for Remote Healthcare. IEEE Journal of Biomedical\nand Health Informatics, vol. 26, no. 10, pp. 5165–5176, 2022. — A\nmétrica Number of Blocks Lost é utilizada para avaliar a confiabilidade da transmissão de blocos em redes blockchain de saúde,\nmedindo falhas de propagação e perdas em canais distribuídos.\n235"
  },
  "source": {
    "pdf": "catalogo_de_metricas.pdf",
    "table": "Tabela 97"
  }
}
